// өгөгдсөн массивт хамгийн олон давтагдсан  тоог ол
console.time();
let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 5, 10, 5]; //  C1: O(1) -Тогтмол хугацаатай байна
let Davtalt = 0; //    C2: O(1) - Тогтмол хугацаатай байна
let DavtsanElement; //    C2: O(1) - Тогтмол хугацаатай байна

for (let i = 0; i < arr.length; i++) {      //  (C4*n) - гадна давталт n хугацаанд,  өгөгдсөн массивын уртаар давтана n удаа давтана
    let tooloh = 0;         // C5: O(1) - Тогтмол хугацаатай байна
    for (let j = 0; j < arr.length; j++) {          //(C6*n) - гаднах даталт ажиллах үед доторх давталт ажиллана n удаа давтана
        if (arr[i] == arr[j]) {         // (C7) O(1) - Тогтмол хугацаатай байна давталт ажиллах бүрт ажиллана
            tooloh++;
        }
    }
    if (tooloh > Davtalt) {         // (C8) O(1) - доторх давталт давтаж дуусах үед 1 удаа хийгдэнэ тогтмол хугацаатай байна
        Davtalt = tooloh;
        DavtsanElement = arr[i];
    }
}

console.log('davtsan too ' + DavtsanElement + ' heden udaa ' + Davtalt);    //  (C9) - тогтмол хугацаатай байна

// C1(O(1)) + C2(CO(1)) + C3(O(1)) + C4(O(n)) + C5(O(1)) + C6(O(n)) + C7(O(1)) + C8(O(1)) = C * n * n = cn^2 = O(n^2)
//   C * n * n = cn^2 = O(n^2)

console.timeEnd();

